---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoomToSpace
source: html/43cff7ce-8e52-2512-7ba6-086b1a8854dd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTagNotInRoomToSpace Property

[Room] Tag is outside of its [Room]. Enable Leader or move [Room] Tag within its [Room].

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomTagNotInRoomToSpace { get; }
```